OpenNuvoton/NUC472_442BSP/SampleCode/StdDriver/SD_FATFS/main.c
    putchar('\n');

}


#ifdef _SD_USE_INT_
extern void SD_Close_(uint32_t cardSel);

void SD0_Handler(void)
{
    unsigned int volatile isr;
    unsigned int volatile ier;

    // FMI data abort interrupt
    if (SD->GINTSTS & SDH_GINTSTS_DTAIF_Msk)
    {
        /* ResetAllEngine() */
        SD->GCTL |= SDH_GCTL_GCTLRST_Msk;
    }

    //----- SD interrupt status
    isr = SD->INTSTS;
    if (isr & SDH_INTSTS_BLKDIF_Msk)     // block down
    {
        extern uint8_t volatile _sd_SDDataReady;
        _sd_SDDataReady = TRUE;
        SD->INTSTS = SDH_INTSTS_BLKDIF_Msk;
    }

    if (isr & SDH_INTSTS_CDIF0_Msk)   // port 0 card detect
    {
        //----- SD interrupt status
        // delay 10 us to sync the GPIO and SDH
        {
            int volatile delay = SystemCoreClock / 1000000 * 10;
            for(; delay > 0UL; delay--)
            {
                __NOP();
            }
            isr = SD->INTSTS;
        }

#ifdef _USE_DAT3_DETECT_
        if (!(isr & SDH_INTSTS_CDSTS0_Msk))
        {
            SD0.IsCardInsert = FALSE;
            SD_Close_(0);
        }
        else
        {
            disk_initialize(SD_Drv);
        }
#else
        if (isr & SDH_INTSTS_CDSTS0_Msk)
        {
            SD0.IsCardInsert = FALSE;   // SDISR_CD_Card = 1 means card remove for GPIO mode
            SD_Close_(0);
        }
        else
        {
            disk_initialize(SD_Drv);
        }
#endif

        SD->INTSTS = SDH_INTSTS_CDIF0_Msk;
    }

    // CRC error interrupt
    if (isr & SDH_INTSTS_CRCIF_Msk)
    {
        if (!(isr & SDH_INTSTS_CRC16_Msk))
        {
            //printf("***** ISR sdioIntHandler(): CRC_16 error !\n");
            // handle CRC error
        }
        else if (!(isr & SDH_INTSTS_CRC7_Msk))
        {
            extern uint32_t _sd_uR3_CMD;
            if (! _sd_uR3_CMD)
            {
                //printf("***** ISR sdioIntHandler(): CRC_7 error !\n");
                // handle CRC error
            }
        }
        SD->INTSTS = SDH_INTSTS_CRCIF_Msk;      // clear interrupt flag
    }


}


void SD_IRQHandler(void)
{

    if( ((SD->CTL & SDH_CTL_SDPORT_Msk) >> (SDH_CTL_SDPORT_Pos)) == 0 )
    {
        SD0_Handler();
    }
    else if( ((SD->CTL & SDH_CTL_SDPORT_Msk) >> (SDH_CTL_SDPORT_Pos)) == 1 )
    {
        //SD1_Handler();
    }

}
#endif

void SYS_Init(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();


    CLK->PWRCTL |= CLK_PWRCTL_HXTEN_Msk;

    // init_pll 84M Hz
    CLK->PLLCTL = 0x401a;   // 84 MHz
    CLK->CLKSEL0 = (CLK->CLKSEL0 & ~(CLK_CLKSEL0_HCLKSEL_Msk)) | (0x2 << CLK_CLKSEL0_HCLKSEL_Pos);


    CLK->CLKSEL0 = (CLK->CLKSEL0 & ~(CLK_CLKSEL0_SDHSEL_Msk)); // SD clock from XTL(12MHz)


    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF2MFP_Msk)) | (0x4 << SYS_GPF_MFPL_PF2MFP_Pos); // SD0_DAT3: GPF_2
    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF3MFP_Msk)) | (0x4 << SYS_GPF_MFPL_PF3MFP_Pos); // SD0_DAT2: GPF_3
    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF4MFP_Msk)) | (0x4 << SYS_GPF_MFPL_PF4MFP_Pos); // SD0_DAT1: GPF_4
    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF5MFP_Msk)) | (0x4 << SYS_GPF_MFPL_PF5MFP_Pos); // SD0_DAT0: GPF_5
    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF6MFP_Msk)) | (0x4 << SYS_GPF_MFPL_PF6MFP_Pos); // SD0_CDn : GPF_6
    SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF7MFP_Msk)) | (0x4 << SYS_GPF_MFPL_PF7MFP_Pos); // SD0_CMD : GPF_7
    SYS->GPF_MFPH = (SYS->GPF_MFPH & ~(SYS_GPF_MFPH_PF8MFP_Msk)) | (0x4 << SYS_GPF_MFPH_PF8MFP_Pos); // SD0_CLK : GPF_8


    /* Enable IP clock */
    CLK->APBCLK0 |= CLK_APBCLK0_UART0CKEN_Msk; // UART0 Clock Enable
    CLK->AHBCLK |= CLK_AHBCLK_SDHCKEN_Msk; // SD Card driving clock.

    /* Select IP clock source */
    CLK->CLKSEL1 &= ~CLK_CLKSEL1_UARTSEL_Msk;
    CLK->CLKSEL1 |= (0x0 << CLK_CLKSEL1_UARTSEL_Pos);// Clock source from external 12 MHz or 32 KHz crystal clock

    /* User can use SystemCoreClockUpdate() to calculate PllClock, SystemCoreClock and CycylesPerUs automatically. */
    SystemCoreClockUpdate();

    /* Set PG multi-function pins for UART0 RXD, TXD */
    SYS->GPG_MFPL &= ~(SYS_GPG_MFPL_PG1MFP_Msk | SYS_GPG_MFPL_PG2MFP_Msk);
    SYS->GPG_MFPL |= (SYS_GPG_MFPL_PG1MFP_UART0_RXD | SYS_GPG_MFPL_PG2MFP_UART0_TXD);


    UART0->LINE |=0x07;
    UART0->BAUD = 0x30000067; /* 12MHz reference clock input, for 115200 */


    /* Lock protected registers */
    SYS_LockReg();

}


/*---------------------------------------------------------*/
/* User Provided RTC Function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support an RTC.                     */
/* This function is not required in read-only cfg.         */

unsigned long get_fattime (void)
{
    unsigned long tmr;

    tmr=0x00000;

    return tmr;
}

uint8_t Read_Buf[1024];
uint8_t Write_Buf[1024];

uint32_t volatile prestate = 0;
extern uint32_t SD_CardDetection(uint32_t u32CardNum);
int32_t main(void)
{
    char *ptr, *ptr2;
    long p1, p2, p3;
    BYTE *buf;
    FATFS *fs;              /* Pointer to file system object */
    FRESULT res;
    DIR dir;                /* Directory object */
    FIL file1, file2;       /* File objects */
    UINT s1, s2, cnt;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;
    TCHAR sd_path[] = { '0', ':', 0 }; /* SD drive started from 0 */
    uint32_t volatile state=0;

    SYS_Init();

#ifdef _SD_USE_INT_
    SD_ENABLE_INT(SDH_INTEN_CDIEN0_Msk);
    NVIC_EnableIRQ(SD_IRQn);
#endif  //_SD_USE_INT_

    printf("\n\nNUC470 SD FATFS TEST!\n");
    printf("rc=%d\n", (WORD)disk_initialize(SD_Drv));
    put_rc(f_mount(&FatFs[0], sd_path, 1));

    for (;;)
    {
        if (SD_CardDetection(SD_PORT0) == 0)
        {
            if (state == 0)
            {
                printf("card remove\n");
                prestate = 0;
                state = 1;
            }
            continue;
        }
        state = 0;

        if ((SD0.IsCardInsert == 1) && (SD0.IsCardInsert != prestate))
        {
            disk_initialize(SD_Drv);
        }
        printf(_T(">"));
        ptr = Line;
        get_line(ptr, sizeof(Line));
        switch (*ptr++)
        {

        case 'q' :  /* Exit program */
            return 0;

